# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
#  n: [0.33, 0.25, 1024]
  n: [1, 0.25, 1024]
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, RepHDW, [128, True, 0.5, 3, 3]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, RepHDW, [256, True, 0.5, 5, 3]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 1, RepHDW, [512, True, 0.5, 7, 3]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, RepHDW, [1024, True, 0.5, 9, 3]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [6, 1, AVG, []]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, RepHDW, [512, False, 0.5, 9, 3]] #13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, AVG, []]
  - [[-1, 6, -2], 1, Concat, [1]]
  - [-1, 1, RepHDW, [384, False, 0.5, 7, 3]] #17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, AVG, []]
  - [[-1, 4, -2], 1, Concat, [1]]
  - [-1, 1, RepHDW, [384, False, 0.5, 5, 3]] #21

  - [[-1, 18], 1, Concat, [1]]
  - [-1, 1, RepHDW, [384, False, 0.5, 5, 3]] # 23

  - [-1, 1, Conv, [192, 3, 2]]
  - [21, 1, AVG, []]
  - [[-2, -1, 17, 14], 1, Concat, [1]]
  - [-1, 1, RepHDW, [384, False, 0.5, 7, 3]] # 27

  - [-1, 1, Conv, [512, 3, 2]]
  - [17, 1, AVG, []]
  - [[-2, -1, 13], 1, Concat, [1]]
  - [-1, 1, RepHDW, [512, False, 0.5, 9, 3]] # 31
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#  - [-1, 3, C2f, [512]] # 13
#
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#  - [-1, 3, C2f, [256]] # 16 (P3/8-small)
#
#  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 13], 1, Concat, [1]] # cat head P4
#  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)
#
#  - [-1, 1, SCDown, [512, 3, 2]]
#  - [[-1, 10], 1, Concat, [1]] # cat head P5
#  - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)

  - [[23, 27, 31], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
